# GetRelatedProducts Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo..::..GetRelatedProducts Method
IFCLevelInfo Class See Also
---
Gets all building products on this level.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetRelatedProducts()
```

Visual Basic
---
```text
Public Function GetRelatedProducts As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetRelatedProducts()
```

# ### Return Value
The collection of products.
# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace